Repository: Rafinha19/memento_client
Catalog: lib/l10n/app_*.arb
Languages: es

source: Edit profile
es: Editar perfil

source: Server error
es: Error en el servidor

# error
source: Errror
es: Error

# unexpected_error
source: Unexpected error, please try again later
es: Error inesperado, por favor intentalo de nuevo más tarde

source: Login error
es: Error al hacer login

# login_errorDESC
source: We haven't found an account with that combination of username and password
es: No hemos encontrado una cuenta con esa combinación de nombre de usuario y contraseña

# login_pass_mustbe_4long
source: Password must be 4 characters long
es: La contraseña debe ser de 4 caracteres mínimo

# login_user_havent_found
source: We haven't found any account with that combination of username and password
es: No hemos encontrado ninguna cuenta con esa combinacion de usuario y contraseña

source: Connection error
es: Error de conexión

# connection_error_description
source: There was a problem with the internet connection, please check your connection and try again later
es: Hubo un problema con la conexión a internet

# server_error_description
source: There was a problem with the server, please try again later
es: Hubo un problema con el servidor, por favor vuelve a intentarlo más tarde

source: Username
es: Nombre de usuario

# username_hint
source: Enter your username
es: Introduce tu nombre de usuario

source: Password
es: Contraseña

# password_hint
source: Minimum 4 characters
es: Longitud mínima de 4 caracteres

source: Login
es: Iniciar sesión

source: Dont have an account?
es: ¿No tienes una cuenta?

source: Sign up
es: Crear una cuenta

source: Create an account
es: Crear una cuenta

source: Repeat password
es: Repite tu contraseña

# repeat_password_hint
source: Repeat your password
es: Repite tu contraseña

# email_hint
source: Enter your email
es: Introduce tu email

# fill_all_data
source: Fill all the data
es: Rellena todos los campos

# fill_add_data_description
source: Please, fill all the data
es: Por favor, rellena todos los campos

source: Not a valid email
es: Correo no valido

# not_a_valid_email_description
source: Please enter a valid email
es: Por favor introduce un correo válido

source: Not a valid password
es: Contraseña no válida

# not_a_valid_password_description
source: Your password should be at least 4 characters long
es: Tu contraseña debe tener una longitud de al menos 4 caracteres

source: Passwords don't match
es: Las contraseñas no coinciden

# passwords_dont_match_description
source: Please rewrite the passwords
es: Por favor, vuelve a escribir las contraseñas

# username_already_registered
source: That username is already registered
es: Ese nombre de usuario ya está registrado

# username_already_registered_description
source: Please try to sign up using another username or log in if you already have an account
es: Por favor, intenta usar otro nombre de usuario o haz login si ya tienes una cuenta

# email_already_in_use
source: That email is already in use
es: Ese correo ya esta en uso

# email_already_in_use_description
source: There is already an account registered with that email
es: Ya existe una cuenta registrada con ese correo

source: Sign out
es: Cerrar sesión

source: Current reel
es: Carrete actual

# reel_singular
source: reel
es: carrete

# reel_plural
source: reels
es: carretes

source: Friends list
es: Lista de amigos

source: of 9 photos
es: de 9 fotos

# noImageSelectedYet
source: You haven't selected a photo yet
es: No has seleccionado una foto aún

# currentReelIsFull
source: The current reel is already full
es: El carrete actual está lleno

source: OR
es: O

# selectAnImage
source: Select a photo
es: Selecciona una foto

# uploadPhotoReel
source: Upload photo to reel
es: Subir foto al carrete

source: Browse galery
es: Buscar en la galería

source: Take a picture
es: Sacar una foto

source: Friends
es: Amigos

source: Add friends
es: Añadir amigos

source: Friend requests
es: Solicitudes de amistad

# noNewFriendRequests
source: There aren't any new friend requests
es: No hay solicitudes de amistad nuevas

source: User list
es: Lista de usuarios

# friendswitheveryone
source: You are friends with every user of the app
es: Eres amigo de todos los usuarios actuales de la aplicación

source: Friendship deleted
es: Amistad borrada

# friendshipDeletedDESC
source: You are no longer friends with user
es: Ya no eres amigo del usuario

# friendRequestCREATED
source: Friendship created
es: Solicitud de amistad creada

# friendRequestCREATED_DESC
source: A friend request has been created with user
es: Se ha creado una solicitud de amistad con el usuario

# friendRequestPENDING
source: Friendship pending
es: Solicitud de amistad pendiente

# pendingFriendRequestWITHUser
source: You have already a pending friend request with user
es: Ya tienes una solicitud de amistad pendiente con el usuario

# pendingFriendRequestFROMUser
source: You have already a pending friend request from user
es: Ya tienes una solicitud de amistad pendiente del usuario

# friendRequestACEPTED
source: Friend request accepted
es: Solicitud de amistad aceptada

# friendRequestACEPTED_DESC
source: You have accepted the friend request from user
es: Has aceptado la solicitud de amistad del usuario

source: Friend request denied
es: Solicitud de amistad denegada

# friendRequestDENIED_DESC
source: You have denied the friend request from user
es: Has denegado la solicitud de amistad del usuario

# youHaventAddedUsers
source: Oops, it seems like you haven't added any users yet
es: Vaya, parece que no has agregado a ningún usuario de momento

source: Edit photo
es: Editar foto

source: Deleted image
es: Imagen eliminada

# deletedImage_DESC
source: The image has been deleted from the server
es: La imagen ha sido eliminada del servidor

source: Description
es: Descripción

source: Save changes
es: Guardar cambios

# saveChangesOneLine
source: Save changes
es: Guardar cambios

source: Edit user data
es: Editar datos del usuario

source: Changes saved
es: Cambios guardados

# emailUpdated
source: Your email has been updated
es: Tu email se ha actualizado

source: Edit credentials
es: Editar credenciales

source: Current password
es: Contraseña actual

source: New password
es: Nueva contraseña

# repeatNewPassword
source: Repeat the new password
es: Repite la nueva contraseña

# newPasswordsDontMatchHint
source: Please, write again the new passwords
es: Por favor, vuelve a escribir las contraseñas nuevas

# credentialsUpdated
source: Your credentials have been updated
es: Tus credenciales se han actualizado

# currentPasswordIsWrong
source: Your current password is wrong
es: Tu contraseña actual está mal

# currentPasswordIsWrongHint
source: Please, write your current password again
es: Por favor, vuelve a escribir tu contraseña actual

source: Edit profile picture
es: Editar foto de perfil

# selectNewPicture
source: Select a new picture
es: Selecciona una nueva foto

# profilePictureUpdated
source: Your profile picture has been updated
es: Tu foto de perfil se ha actualizado

# selectNewPictureHint
source: Select a new profile picture
es: Selecciona una nueva foto de perfil

source: Generate Memento
es: Generar Memento

source: You can't generate the Memento
es: No puedes generar el Memento

# youcantGeneratetheMementoDESC
source: The reel has to be full in order to generate the Memento
es: Es necesario que el carrete esté lleno para poder generar el Memento
